# 第6章 数据加载、存储与文件格式

## 6.1 读写文本格式的数据

In [3]:
!type D:\Jupyter_notebook_file\Python_for_Data_Analysis_2nd\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
# Linux下用!cat examples/ex1.csv

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('.\examples\ex1.csv')

In [12]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_table('.\examples\ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!type .\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [21]:
 pd.read_csv('.\examples\ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [22]:
 pd.read_csv('.\examples\ex1.csv',names=['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [23]:
names = ['a', 'b', 'c', 'd', 'message']

In [24]:
pd.read_csv('.\examples\ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [25]:
!type .\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [27]:
parsed = pd.read_csv('.\examples\csv_mindex.csv',
                     index_col=['key1', 'key2'])

In [33]:
list(open('.\examples\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [30]:
result = pd.read_table('.\examples\ex3.txt', sep='\s+')

In [31]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [34]:
!type .\examples\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [35]:
!type .\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [39]:
pd.read_csv('.\examples\ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [40]:
pd.read_csv('.\examples\ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [41]:
!type .\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [43]:
result = pd.read_csv('.\examples\ex5.csv')

In [44]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [48]:
pd.notnull(result)

   something     a     b      c     d  message
0       True  True  True   True  True    False
1       True  True  True  False  True     True
2       True  True  True   True  True     True

In [49]:
result = pd.read_csv('.\examples\ex5.csv', na_values=['NULL'])

In [50]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [54]:
pd.read_csv('.\examples\ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 逐块读取文本文件

In [55]:
pd.options.display.max_rows = 10

In [59]:
result = pd.read_csv('.\examples\ex6.csv')

In [60]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [61]:
pd.read_csv('.\examples\ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [62]:
chunksize = pd.read_csv('.\examples\ex6.csv', chunksize=1000)

In [63]:
chunksize

In [65]:
chunker = pd.read_csv('.\examples\ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [66]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 将数据写出到文本格式

In [67]:
data = pd.read_csv('.\examples\ex5.csv')

In [68]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [69]:
data.to_csv('out.csv')

In [70]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [71]:
import sys

In [73]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [74]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [76]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [77]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [78]:
dates = pd.date_range('1/1/2000', periods=7)

In [80]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [81]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [82]:
ts.to_csv('tseries.csv')

In [83]:
!type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### 处理分隔符格式

In [ ]:
!type .\examples\ex6.csv

In [ ]:
import csv

In [86]:
f = open('.\examples\ex7.csv')

In [87]:
reader = csv.reader(f)

In [88]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [91]:
f.close()

In [13]:
with open ('.\examples\ex7.csv') as f:
    for line in f:
        print(line)
    f.seek(0)
    
    for line in csv.reader(f):
        print(line)
    f.seek(0)
    lines = list(csv.reader(f))
    print(lines)

"a","b","c"

"1","2","3"

"1","2","3"

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']
[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [93]:
header, values = lines[0], lines[1:]

In [95]:
header

['a', 'b', 'c']

In [96]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [9]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [10]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [22]:
f = open('.\examples\ex7.csv')
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [23]:
reader = csv.reader(f, delimiter='|')
f.close()

In [24]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### JSON数据

In [27]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [25]:
import json

In [28]:
result = json.loads(obj)

In [29]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [30]:
asjson = json.dumps(result)

In [31]:
import pandas as pd

In [33]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [34]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [35]:
!type .\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [46]:
data = pd.read_json('.\examples\example.json')

In [47]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [48]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [49]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML和HTML：Web信息采集

In [55]:
# table = pd.read_html('.\examples\fdic_failed_bank_list.html')  # 报错

### 利用lxml.bojectify解析XML

In [79]:
from lxml import objectify
path = './examples/Performance_MNR.xml'
parsed = objectify.parse(open(path))
# print(parsed)
root = parsed.getroot()

In [80]:
# data = []
# skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
#                'DESIRED_CHANGE', 'DECIMAL_PLACES']
# for elt in root.INDICATOR:
#     el_data = {}
#     for child in elt.getchildren():
#         if child.tag in skip_fields:
#             continue
#         el_data[child.tag] = child.pyval
#     data.append(el_data)

In [82]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [83]:
root

In [84]:
root.get('href')

'http://www.google.com'

In [85]:
root.text

'Google'

## 6.2 二进制数据格式

In [86]:
frame = pd.read_csv('.\examples\ex1.csv')

In [87]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [88]:
frame.to_pickle('frame_pickle')

In [89]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 使用HDF5格式

In [93]:
import pandas as pd
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})

In [94]:
store = pd.HDFStore('mydata.h5')

In [95]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [96]:
store['obj1'] = frame

In [97]:
store['obj1_col'] = frame['a']

In [98]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [99]:
store['obj1']

           a
0  -0.716230
1   0.080890
2   1.292670
3  -1.239568
4  -0.077467
5   0.947034
6   0.173019
7  -0.190110
8   0.486061
9  -1.297249
10 -0.381112
11 -0.360012
12  1.730372
13 -0.962382
14  0.390849
15  0.585377
16  1.348590
17  1.821244
18 -0.555876
19  0.616787
20 -0.481313
21  0.967208
22  0.227102
23  1.856529
24  2.098341
25 -0.372399
26  1.267696
27 -0.393345
28  0.404557
29  1.428658
..       ...
70  1.003944
71 -0.670869
72 -0.359864
73 -0.295703
74 -0.846462
75  0.048174
76 -0.521576
77  0.725793
78 -0.241081
79  0.833579
80 -0.864727
81  1.528615
82  0.362517
83 -0.268573
84  0.824836
85 -0.587016
86 -1.797285
87 -0.773878
88  1.213076
89  0.126407
90  0.641803
91 -0.944122
92 -0.252509
93 -0.779342
94  1.848594
95 -0.364606
96  0.870344
97 -1.655781
98 -0.473802
99  1.065881

[100 rows x 1 columns]

In [100]:
store.put('obj2', frame, format='table')

In [101]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.381112
11 -0.360012
12  1.730372
13 -0.962382
14  0.390849
15  0.585377

In [102]:
store.close()

In [103]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [104]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.716230
1  0.080890
2  1.292670
3 -1.239568
4 -0.077467

### 读取Microsoft Excel文件

In [105]:
xlsx = pd.ExcelFile('.\examples\ex1.xlsx')

In [106]:
xlsx

In [107]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [108]:
frame = pd.read_excel('.\examples\ex1.xlsx', 'Sheet1')

In [109]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [112]:
writer = pd.ExcelWriter('.\examples\ex2.xlsx')

In [113]:
writer

In [114]:
frame.to_excel(writer, 'Sheet1')

In [115]:
writer.save()

In [116]:
frame.to_excel('ex2.xlsx')

## 6.3 Web APIs交互

In [117]:
import requests

In [118]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [119]:
resp = requests.get(url)

In [120]:
resp

In [121]:
data = resp.json()

In [125]:
data[0]['title']

'DOC: Test doctests in pandas/core/tools/datetimes.py '

In [126]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

In [127]:
issues

,number,title,labels,state
0,26402,DOC: Test doctests in pandas/core/tools/dateti...,[],open
1,26401,Test doctests in pandas/core/tools/datetimes.py,[],open
2,26400,ENH: Support multiple opening hours intervals ...,[],open
3,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
4,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
5,26397,DataFrame.describe excludes top and freq for e...,[],open
6,26396,CLN: remove compat.lrange,"[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
7,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
8,26394,"pd.to_numeric(..., errors='ignore') returns Na...","[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
9,26393,Holiday based on the lunar calendar?,[],open
10,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
11,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
12,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
14,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
15,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
16,26384,Remove Deprecated Azure CI Step,[],open
17,26383,Prefixed batch script commands with call,[],open
18,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,26380,ENH: Implementing NEP 18's __array_function__,[],open
20,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
22,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
24,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
25,26370,Feature requests: pandas.DataFrame.quantile wi...,[],open
26,26368,corrwith in 0.24 is much slower than 0.23 (esp...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
27,26367,Pandas import breaks when setting filterwarnings,[],open
28,26366,Fix type annotations for pandas.core.indexes.d...,[],open
29,26359,BUG: groupby.agg returns incorrect results for...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## 6.4 数据库交互

In [128]:
import sqlite3

In [129]:
query = """
CREATE TABLE test 
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""

In [130]:
con = sqlite3.connect('mydata.sqlite')

In [131]:
con.execute(query)

In [133]:
con.commit()

In [134]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [135]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [136]:
con.executemany(stmt, data)

In [137]:
con.commit()

In [138]:
cursor = con.execute('select * from test')

In [139]:
rows = cursor.fetchall()

In [140]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [141]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [142]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [143]:
import sqlalchemy as sqla

In [144]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [145]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

## 6.5 总结

访问数据时数据分析的第一步。

## 继续加油！